valid_media_types = {
    "tv-series": "Сериал",
    "anime": "Аниме",
    "movie": "Фильм",
    "animated-series": "Анимация",
    "cartoon": "Мультфильм"
}

valid_genres = {
    "аниме", "боевик", "вестерн", "военный", "детектив", "детский", "для взрослых",
    "документальный", "драма", "игра", "история", "комедия", "концерт",
    "короткометражка", "криминал", "мелодрама", "музыка", "мультфильм", "мюзикл",
    "новости", "приключения", "реальное тв", "семейный", "спорт", "ток-шоу",
    "триллер", "ужасы", "фантастика", "фильм-нуар", "фэнтези", "церемония"
}

valid_countries = {
    "Австралия", "Австрия", "Азербайджан", "Албания", "Алжир", "Ангола", "Андорра",
    "Антигуа и Барбуда", "Аргентина", "Армения", "Афганистан", "Багамы", "Бангладеш",
    "Барбадос", "Бахрейн", "Белиз", "Белоруссия", "Бельгия", "Бенин", "Болгария",
    "Боливия", "Босния и Герцеговина", "Ботсвана", "Бразилия", "Бруней", "Буркина-Фасо",
    "Бурунди", "Вануату", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Восточный Тимор",
    "Вьетнам", "Габон", "Гаити", "Гайана", "Гамбия", "Гана", "Гватемала", "Гвинея",
    "Гвинея-Бисау", "Германия", "Гондурас", "Гренада", "Греция", "Грузия", "Дания",
    "Джибути", "Доминика", "Доминиканская Республика", "Египет", "Замбия", "Зимбабве",
    "Израиль", "Индия", "Индонезия", "Иордания", "Ирак", "Иран", "Ирландия", "Исландия",
    "Испания", "Италия", "Йемен", "Кабо-Верде", "Казахстан", "Камбоджа", "Камерун",
    "Канада", "Катар", "Кения", "Кипр", "Киргизия", "Кирибати", "Китай", "Колумбия",
    "Коморы", "Конго", "Коста-Рика", "Кот-д’Ивуар", "Куба", "Кувейт", "Лаос", "Латвия",
    "Лесото", "Либерия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксембург",
    "Маврикий", "Мавритания", "Мадагаскар", "Македония", "Малави", "Малайзия", "Мали",
    "Мальдивы", "Мальта", "Марокко", "Маршалловы Острова", "Мексика", "Микронезия",
    "Мозамбик", "Молдова", "Монако", "Монголия", "Мьянма", "Намибия", "Науру", "Непал",
    "Нигер", "Нигерия", "Нидерланды", "Никарагуа", "Новая Зеландия", "Норвегия", "ОАЭ",
    "Оман", "Пакистан", "Палау", "Панама", "Папуа — Новая Гвинея", "Парагвай", "Перу",
    "Польша", "Португалия", "Россия", "Руанда", "Румыния", "Сальвадор", "Самоа",
    "Сан-Марино", "Саудовская Аравия", "Северная Корея", "Сейшелы", "Сенегал", "Сент-Винсент и Гренадины",
    "Сент-Китс и Невис", "Сент-Люсия", "Сербия", "Сингапур", "Сирия", "Словакия",
    "Словения", "Соломоновы Острова", "Сомали", "Судан", "Суринам", "США", "Сьерра-Леоне",
    "Таджикистан", "Таиланд", "Танзания", "Того", "Тонга", "Тринидад и Тобаго", "Тувалу",
    "Тунис", "Туркмения", "Турция", "Уганда", "Узбекистан", "Украина", "Уругвай",
    "Фиджи", "Филиппины", "Финляндия", "Франция", "Хорватия", "ЦАР", "Чад", "Черногория",
    "Чехия", "Чили", "Швейцария", "Швеция", "Шри-Ланка", "Эквадор", "Экваториальная Гвинея",
    "Эритрея", "Эсватини", "Эстония", "Эфиопия", "ЮАР", "Южная Корея", "Ямайка", "Япония"
}